{
  "peft_type": "LORA",
  "base_model_name_or_path": "example/base-model",
  "r": 8,
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "target_modules": ["q_proj", "v_proj"],
  "task_type": "CAUSAL_LM"
}
